javnson/gmp_pro/ctl/suite/mcs_pmsm_nt/project/f29h85x_lp_3phgan/mcs_pmsm_nt_f29h85x_3phgan.syscfg
/**
 * These arguments were used when this file was generated. They will be automatically applied on subsequent loads
 * via the GUI or CLI. Run CLI with '--help' for additional information on how to override these arguments.
 * GMP target derived from TI F29x Motor Control SDK 1.00.00.00
 * servo_drive_BXL_3PHGANINV.syscfg. The pin map is the official
 * LAUNCHXL-F29H85X + BOOSTXL-3PHGANINV mapping.
 * @cliArgs --device "F29H85x" --part "F29H85x_144RFS" --package "144RFS" --context "CPU1" --product "MCU_SDK_F29H85x@1.02.01.00"
 * @v2CliArgs --device "F29H850TU" --package "144RFS" --variant "TMS320F29H850TU9" --context "CPU1" --product "MCU_SDK_F29H85x@1.02.01.00"
 * @versions {"tool":"1.25.0+4237"}
 */

/**
 * Import the modules used in this configuration.
 */
const adc              = scripting.addModule("/driverlib/adc.js", {}, false);
const adc1             = adc.addInstance();
const adc2             = adc.addInstance();
const adc3             = adc.addInstance();
const adc4             = adc.addInstance();
const adc5             = adc.addInstance();
const analog           = scripting.addModule("/driverlib/analog.js", {}, false);
const analog1          = analog.addInstance();
const asysctl          = scripting.addModule("/driverlib/asysctl.js");
const clocktree        = scripting.addModule("/driverlib/clocktree.js");
const cmpss            = scripting.addModule("/driverlib/cmpss.js", {}, false);
const cmpss1           = cmpss.addInstance();
const cmpss2           = cmpss.addInstance();
const cputimer         = scripting.addModule("/driverlib/cputimer.js", {}, false);
const cputimer1        = cputimer.addInstance();
const cputimer2        = cputimer.addInstance();
const dac              = scripting.addModule("/driverlib/dac.js", {}, false);
const dac1             = dac.addInstance();
const epwm             = scripting.addModule("/driverlib/epwm.js", {}, false);
const epwm1            = epwm.addInstance();
const epwm2            = epwm.addInstance();
const epwm3            = epwm.addInstance();
const epwmxbar         = scripting.addModule("/driverlib/epwmxbar.js");
const epwmxbar1        = epwmxbar.addInstance();
const eqep             = scripting.addModule("/driverlib/eqep.js", {}, false);
const eqep1            = eqep.addInstance();
const gpio             = scripting.addModule("/driverlib/gpio.js", {}, false);
const gpio1            = gpio.addInstance();
const gpio2            = gpio.addInstance();
const gpio3            = gpio.addInstance();
const inputxbar_input  = scripting.addModule("/driverlib/inputxbar_input.js", {}, false);
const inputxbar_input1 = inputxbar_input.addInstance();
const inputxbar_input2 = inputxbar_input.addInstance();
const inputxbar_input3 = inputxbar_input.addInstance();
const inputxbar_input4 = inputxbar_input.addInstance();
const interrupt        = scripting.addModule("/driverlib/interrupt.js");
const spi              = scripting.addModule("/driverlib/spi.js", {}, false);
const spi1             = spi.addInstance();
const uart             = scripting.addModule("/driverlib/uart.js", {}, false);
const uart1            = uart.addInstance();

/**
 * Write custom configuration values to the imported modules.
 */
adc1.$name                     = "ADCA_CONFIG";
adc1.adcClockPrescaler         = "ADC_CLK_DIV_4_0";
adc1.socHighPriorityMode       = "ADC_PRI_ALL_HIPRI";
adc1.soc0IndependentNameMode   = true;
adc1.soc1IndependentNameMode   = true;
adc1.soc0Channel               = "ADC_CH_ADCIN7";
adc1.soc1SampleWindow          = 20;
adc1.soc2IndependentNameMode   = true;
adc1.soc2Channel               = "ADC_CH_ADCIN14";
adc1.soc2Trigger               = "ADC_TRIGGER_EPWM5_SOCA";
adc1.soc2SampleWindow          = 20;
adc1.soc2Name                  = "MTR1_VDC";
adc1.interruptPulseMode        = "ADC_PULSE_END_OF_CONV";
adc1.enabledInts               = ["ADC_INT_NUMBER1"];
adc1.enabledPPBs               = ["ADC_PPB_NUMBER1"];
adc1.ppb1IndependentNameMode   = true;
adc1.registerInterrupts        = ["1"];
adc1.soc0Name                  = "MTR1_IV";
adc1.enabledSOCs               = ["ADC_SOC_NUMBER0","ADC_SOC_NUMBER1"];
adc1.soc1Name                  = "MTR1_VDC";
adc1.soc1Channel               = "ADC_CH_ADCIN14";
adc1.interrupt1SOCSource       = "ADC_INT_TRIGGER_EOC1";
adc1.enableInterrupt1          = true;
adc1.soc1Trigger               = "ADC_TRIGGER_EPWM1_SOCA";
adc1.soc0Trigger               = "ADC_TRIGGER_EPWM1_SOCA";
adc1.soc0SampleWindow          = 20;
adc1.ppb1Name                  = "MTR1_IV_PPB";
adc1.periphClock.$name         = "driverlib_perClock0";
adc1.periphConfig.$name        = "driverlib_perConfig0";
adc1.adcInt1.interruptHandler  = "motor1CtrlISR";
adc1.adcInt1.interruptPriority = 1;

adc2.adcClockPrescaler                   = "ADC_CLK_DIV_4_0";
adc2.socHighPriorityMode                 = "ADC_PRI_ALL_HIPRI";
adc2.soc0IndependentNameMode             = true;
adc2.soc1IndependentNameMode             = true;
adc2.soc1Trigger                         = "ADC_TRIGGER_EPWM5_SOCA";
adc2.soc1SampleWindow                    = 20;
adc2.soc2IndependentNameMode             = true;
adc2.soc2Channel                         = "ADC_CH_ADCIN14";
adc2.soc2Trigger                         = "ADC_TRIGGER_EPWM5_SOCA";
adc2.soc2SampleWindow                    = 20;
adc2.soc2Name                            = "MTR1_VDC";
adc2.interruptPulseMode                  = "ADC_PULSE_END_OF_CONV";
adc2.enabledPPBs                         = ["ADC_PPB_NUMBER1"];
adc2.ppb1IndependentNameMode             = true;
adc2.registerInterrupts                  = ["1"];
adc2.$name                               = "ADCB_CONFIG";
adc2.adcBase                             = "ADCB_BASE";
adc2.useInterrupts                       = false;
adc2.soc0Channel                         = "ADC_CH_ADCIN4";
adc2.soc0Name                            = "MTR1_IU";
adc2.soc1Name                            = "MTR1_VDC";
adc2.soc1Channel                         = "ADC_CH_ADCIN14";
adc2.enabledInts                         = ["ADC_INT_NUMBER1"];
adc2.interrupt1SOCSource                 = "ADC_INT_TRIGGER_EOC1";
adc2.enabledSOCs                         = ["ADC_SOC_NUMBER0"];
adc2.soc0Trigger                         = "ADC_TRIGGER_EPWM1_SOCA";
adc2.soc0SampleWindow                    = 20;
adc2.ppb1Name                            = "MTR1_IU_PPB";
adc2.periphClock.$name                   = "driverlib_perClock1";
adc2.periphClock.pinmuxPeripheralModule  = scripting.forceWrite("");
adc2.periphConfig.$name                  = "driverlib_perConfig1";
adc2.periphConfig.pinmuxPeripheralModule = scripting.forceWrite("");

adc3.socHighPriorityMode                 = "ADC_PRI_ALL_HIPRI";
adc3.soc0IndependentNameMode             = true;
adc3.soc1IndependentNameMode             = true;
adc3.soc1Channel                         = "ADC_CH_ADCIN4";
adc3.soc1Trigger                         = "ADC_TRIGGER_EPWM5_SOCA";
adc3.soc1SampleWindow                    = 20;
adc3.soc2IndependentNameMode             = true;
adc3.soc2Channel                         = "ADC_CH_ADCIN14";
adc3.soc2Trigger                         = "ADC_TRIGGER_EPWM5_SOCA";
adc3.soc2SampleWindow                    = 20;
adc3.soc2Name                            = "MTR1_VDC";
adc3.interruptPulseMode                  = "ADC_PULSE_END_OF_CONV";
adc3.enableInterrupt1                    = true;
adc3.interrupt1SOCSource                 = "ADC_INT_TRIGGER_EOC2";
adc3.enabledPPBs                         = ["ADC_PPB_NUMBER1"];
adc3.ppb1IndependentNameMode             = true;
adc3.registerInterrupts                  = ["1"];
adc3.adcBase                             = "ADCC_BASE";
adc3.$name                               = "ADCC_CONFIG";
adc3.soc0Name                            = "MTR1_IW";
adc3.soc1Name                            = "MTR1_VW";
adc3.ppb1Name                            = "MTR1_IW_PPB";
adc3.useInterrupts                       = false;
adc3.adcClockPrescaler                   = "ADC_CLK_DIV_4_0";
adc3.soc0Channel                         = "ADC_CH_ADCIN1";
adc3.enabledSOCs                         = ["ADC_SOC_NUMBER0"];
adc3.soc0Trigger                         = "ADC_TRIGGER_EPWM1_SOCA";
adc3.periphClock.$name                   = "driverlib_perClock2";
adc3.periphClock.pinmuxPeripheralModule  = scripting.forceWrite("");
adc3.periphConfig.$name                  = "driverlib_perConfig2";
adc3.periphConfig.pinmuxPeripheralModule = scripting.forceWrite("");

adc4.$name                               = "ADCD_CONFIG";
adc4.adcBase                             = "ADCD_BASE";
adc4.enabledSOCs                         = ["ADC_SOC_NUMBER0","ADC_SOC_NUMBER1"];
adc4.soc0Channel                         = "ADC_CH_ADCIN25";
adc4.soc0Name                            = "MTR1_VU";
adc4.soc0Trigger                         = "ADC_TRIGGER_EPWM1_SOCA";
adc4.soc1Channel                         = "ADC_CH_ADCIN1";
adc4.soc1Trigger                         = "ADC_TRIGGER_EPWM1_SOCA";
adc4.socHighPriorityMode                 = "ADC_PRI_ALL_HIPRI";
adc4.adcClockPrescaler                   = "ADC_CLK_DIV_4_0";
adc4.soc0IndependentNameMode             = true;
adc4.soc1IndependentNameMode             = true;
adc4.soc1Name                            = "MTR1_VV";
adc4.soc0SampleWindow                    = 20;
adc4.soc1SampleWindow                    = 20;
adc4.periphClock.pinmuxPeripheralModule  = scripting.forceWrite("");
adc4.periphClock.$name                   = "driverlib_perClock14";
adc4.periphConfig.pinmuxPeripheralModule = scripting.forceWrite("");
adc4.periphConfig.$name                  = "driverlib_perConfig12";

adc5.$name                               = "ADCE_CONFIG";
adc5.adcBase                             = "ADCE_BASE";
adc5.enabledSOCs                         = ["ADC_SOC_NUMBER0"];
adc5.soc0Name                            = "MTR1_VW";
adc5.soc0Channel                         = "ADC_CH_ADCIN7";
adc5.adcClockPrescaler                   = "ADC_CLK_DIV_4_0";
adc5.socHighPriorityMode                 = "ADC_PRI_ALL_HIPRI";
adc5.soc0IndependentNameMode             = true;
adc5.soc0Trigger                         = "ADC_TRIGGER_EPWM1_SOCA";
adc5.soc0SampleWindow                    = 20;
adc5.periphClock.pinmuxPeripheralModule  = scripting.forceWrite("");
adc5.periphClock.$name                   = "driverlib_perClock15";
adc5.periphConfig.pinmuxPeripheralModule = scripting.forceWrite("");
adc5.periphConfig.$name                  = "driverlib_perConfig13";

const divider2       = system.clockTree["ECATDIV"];
divider2.divideValue = 2;

const divider4       = system.clockTree["EPWMCLKDIV"];
divider4.divideValue = 1;

const divider15       = system.clockTree["PLL_REFDIV"];
divider15.divideValue = 1;

const multiplier1         = system.clockTree["PLL_IMULT"];
multiplier1.multiplyValue = 40;

const mux7       = system.clockTree["OSCCLKSRCSEL"];
mux7.inputSelect = "INTOSC1";

const pinFunction1     = system.clockTree["AUXCLK"];
pinFunction1.XTAL_Freq = 25;

cmpss1.cmpssBase                           = "CMPSS9_BASE";
cmpss1.enableModule                        = true;
cmpss1.highCTRIPOUT                        = "CMPSS_TRIPOUT_FILTER";
cmpss1.highCTRIP                           = "CMPSS_TRIP_FILTER";
cmpss1.dacValHigh                          = 3584;
cmpss1.initFilterHigh                      = true;
cmpss1.sampleWindowHigh                    = 32;
cmpss1.thresholdHigh                       = 30;
cmpss1.samplePrescaleHigh                  = 32;
cmpss1.asysCMPLPMXSELValue                 = "2";
cmpss1.$name                               = "MTR1_CMPSS_V";
cmpss1.asysCMPHPMXSELValue                 = "2";
cmpss1.initFilterLow                       = true;
cmpss1.clearFilterLatchLow                 = true;
cmpss1.samplePrescaleLow                   = 32;
cmpss1.sampleWindowLow                     = 32;
cmpss1.thresholdLow                        = 30;
cmpss1.dacValLow                           = 512;
cmpss1.clearFilterLatchHigh                = true;
cmpss1.lowCompInvert                       = true;
cmpss1.lowCTRIPOUT                         = "CMPSS_TRIPOUT_FILTER";
cmpss1.lowCTRIP                            = "CMPSS_TRIP_FILTER";
cmpss1.periphClock.pinmuxPeripheralModule  = scripting.forceWrite("");
cmpss1.periphClock.$name                   = "driverlib_perClock3";
cmpss1.periphConfig.pinmuxPeripheralModule = scripting.forceWrite("");
cmpss1.periphConfig.$name                  = "driverlib_perConfig3";

cmpss2.enableModule                        = true;
cmpss2.highCTRIPOUT                        = "CMPSS_TRIPOUT_FILTER";
cmpss2.highCTRIP                           = "CMPSS_TRIP_FILTER";
cmpss2.sampleWindowHigh                    = 32;
cmpss2.thresholdHigh                       = 30;
cmpss2.samplePrescaleHigh                  = 32;
cmpss2.lowCTRIPOUT                         = "CMPSS_TRIPOUT_FILTER";
cmpss2.lowCTRIP                            = "CMPSS_TRIP_FILTER";
cmpss2.lowCompInvert                       = true;
cmpss2.initFilterLow                       = true;
cmpss2.clearFilterLatchLow                 = true;
cmpss2.samplePrescaleLow                   = 32;
cmpss2.sampleWindowLow                     = 32;
cmpss2.thresholdLow                        = 30;
cmpss2.dacValLow                           = 512;
cmpss2.cmpssBase                           = "CMPSS7_BASE";
cmpss2.dacValHigh                          = 3584;
cmpss2.initFilterHigh                      = true;
cmpss2.$name                               = "MTR1_CMPSS_U";
cmpss2.asysCMPHPMXSELValue                 = "1";
cmpss2.asysCMPLPMXSELValue                 = "1";
cmpss2.clearFilterLatchHigh                = true;
cmpss2.periphClock.pinmuxPeripheralModule  = scripting.forceWrite("");
cmpss2.periphClock.$name                   = "driverlib_perClock5";
cmpss2.periphConfig.pinmuxPeripheralModule = scripting.forceWrite("");
cmpss2.periphConfig.$name                  = "driverlib_perConfig5";

