javnson/gmp_pro/ctl/suite/mcs_pmsm_nt/project/f29h85x_lp_3phgan/mcs_pmsm_nt_f29h85x_3phgan.syscfg
epwmxbar.lockConfiguration = true;

epwmxbar1.$name         = "MTR1_IS_TRIP_CMPSS";
epwmxbar1.tripInput     = "XBAR_TRIP7";
epwmxbar1.sourceSignals = ["CMPSS11_CTRIPH","CMPSS11_CTRIPL","CMPSS7_CTRIPH","CMPSS7_CTRIPL","CMPSS9_CTRIPH","CMPSS9_CTRIPL"];

eqep1.positionCounterMode  = "EQEP_POSITION_RESET_MAX_POS";
eqep1.positionCounterMax   = 3999;
eqep1.latchPositionCounter = "EQEP_LATCH_UNIT_TIME_OUT";
eqep1.positionIndexEvents  = "EQEP_INIT_RISING_INDEX";
eqep1.swPositionInit       = true;
eqep1.enableModule         = true;
eqep1.captureConfig        = true;
eqep1.capPrescale          = "EQEP_CAPTURE_CLK_DIV_128";
eqep1.evntPrescale         = "EQEP_UNIT_POS_EVNT_DIV_32";
eqep1.enableCapture        = true;
eqep1.enableUnitTimer      = true;
eqep1.unitTimerPeriod      = 20000;
eqep1.enableInterrupt      = true;
eqep1.interruptSources     = ["EQEP_INT_UNIT_TIME_OUT"];
eqep1.emulationMode        = "EQEP_EMULATIONMODE_RUNFREE";
eqep1.$name                = "MTR1_QEP";
eqep1.useInterrupts        = false;
eqep1.periphClock.$name    = "driverlib_perClock12";
eqep1.periphConfig.$name   = "driverlib_perConfig10";

gpio1.direction         = "GPIO_DIR_MODE_OUT";
gpio1.writeInitialValue = true;
gpio1.initialValue      = 1;
gpio1.$name             = "MTR1_GATE_EN";
gpio1.qualMode          = "GPIO_QUAL_3SAMPLE";
gpio1.gpioPin.$assign   = "GPIO19";

gpio2.$name             = "LAUNCHPAD_LED1";
gpio2.writeInitialValue = true;
gpio2.direction         = "GPIO_DIR_MODE_OUT";
gpio2.gpioPin.$assign   = "GPIO62";

gpio3.$name           = "MTR1_PM_nFAULT";
gpio3.padConfig       = "PULLUP";
gpio3.qualMode        = "GPIO_QUAL_3SAMPLE";
gpio3.gpioPin.$assign = "GPIO14";

inputxbar_input1.inputxbarGpio  = "GPIO84";
inputxbar_input1.inputxbarLock  = true;
inputxbar_input1.$name          = "MTR1_QEPA_IN";
inputxbar_input1.inputxbarInput = "XBAR_INPUT33";

inputxbar_input2.$name          = "MTR1_QEPB_IN";
inputxbar_input2.inputxbarInput = "XBAR_INPUT34";
inputxbar_input2.inputxbarGpio  = "GPIO17";
inputxbar_input2.inputxbarLock  = true;

inputxbar_input3.$name          = "MTR1_QEPI_IN";
inputxbar_input3.inputxbarInput = "XBAR_INPUT35";
inputxbar_input3.inputxbarGpio  = "GPIO34";
inputxbar_input3.inputxbarLock  = true;

inputxbar_input4.$name         = "MTR1_PM_nFAULT_IN";
inputxbar_input4.inputxbarGpio = "GPIO14";
inputxbar_input4.inputxbarLock = true;

interrupt.RTINT_Threshold = 5;

spi1.mode                    = "SPI_MODE_CONTROLLER";
spi1.bitRate                 = 4000000;
spi1.txFifo                  = "SPI_FIFO_TX4";
spi1.rxFifo                  = "SPI_FIFO_RX4";
spi1.useCase                 = "CUSTOM";
spi1.useInterfacePins        = ["SPI@_CLK","SPI@_PICO","SPI@_PTE"];
spi1.emulationMode           = "SPI_EMULATION_FREE_RUN";
spi1.$name                   = "DAC_SPI";
spi1.periphClock.$name       = "driverlib_perClock13";
spi1.periphConfig.$name      = "driverlib_perConfig11";
spi1.spi.$assign             = "SPIB";
spi1.spi.spi_picoPin.$assign = "GPIO63";
spi1.spi.spi_clkPin.$assign  = "GPIO26";
spi1.spi.spi_ptePin.$assign  = "GPIO66";
spi1.clkQual.$name           = "myGPIOQUAL1";
spi1.picoQual.$name          = "myGPIOQUAL0";
spi1.pteQual.$name           = "myGPIOQUAL2";

uart1.$name                    = "GMP_DEBUG_UART";
uart1.baudSelect               = "115200";
uart1.registerInterrupts       = false;
uart1.uart.$assign             = "UARTA";
uart1.uart.uart_txPin.$assign  = "GPIO38";
uart1.uart.uart_rxPin.$assign  = "GPIO43";
uart1.txQual.$name             = "GMP_DEBUG_UART_TX_QUAL";
uart1.rxQual.$name             = "GMP_DEBUG_UART_RX_QUAL";
uart1.periphClock.$name        = "driverlib_perClock17";
uart1.periphConfig.$name       = "driverlib_perConfig15";

/**
 * Pinmux solution for unlocked pins/peripherals. This ensures that minor changes to the automatic solver in a future
 * version of the tool will not impact the pinmux you originally saw.  These lines can be completely deleted in order to
 * re-solve from scratch.
 */
analog1.analog.$suggestSolution                           = "ANALOG";
analog1.analog["a3/d25Pin"].$suggestSolution              = "A3/D25";
analog1.analog["a7/e25, gpio225Pin"].$suggestSolution     = "A7/E25, GPIO225";
analog1.analog["a14/b14/c14/d14/e14Pin"].$suggestSolution = "A14/B14/C14/D14/E14";
analog1.analog["b4/d30Pin"].$suggestSolution              = "B4/D30";
analog1.analog["c1/e29Pin"].$suggestSolution              = "C1/E29";
analog1.analog["d1/b25Pin"].$suggestSolution              = "D1/B25";
analog1.analog["e0/a24/dacb_outPin"].$suggestSolution     = "E0/A24/DACB_OUT";
analog1.analog["e7/a31, gpio249Pin"].$suggestSolution     = "E7/A31, GPIO249";
